# MEPAnalyticalNode Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalNode Members
MEPAnalyticalNode Class Methods Properties See Also
---
The MEPAnalyticalNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the MEPAnalyticalNode |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsSameNode | Verify if this node is connected to the other node and thus represents the same analytical node in the network. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Id | The identity used in the MEPAnalyticalSegment |
| IsFlowBlocked | Is the flow blocked at this analytical node? |
| IsFocalNode | Is this node a focal point of multiple branches? |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Location | The location of this node. |

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace